In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

## Combining dataframes

 Create some toy data

In [2]:
df1 = pd.DataFrame({'Name': ['Tom Cruise', 'Robert Downey Jr', 'Chris Hemsworth', 'Jennifer Lawrence'],\
                   'Age':[56, 53, 35, 28 ],\
                   'Gender': ['Male', 'Male', 'Male', 'Female']})

In [3]:
df1

                Name  Age  Gender
0         Tom Cruise   56    Male
1   Robert Downey Jr   53    Male
2    Chris Hemsworth   35    Male
3  Jennifer Lawrence   28  Female

In [4]:
df2 = pd.DataFrame({'Actor_name': ['Jennifer Lawrence','Tom Cruise', 'Johnny Depp', 'Kim Kardashian'],\
                  'Gender': ['Female', 'Male', 'Male', 'Female'],\
                  'Net_worth_millions': [60, 470, 400, 85]})

In [5]:
df2

          Actor_name  Gender  Net_worth_millions
0  Jennifer Lawrence  Female                  60
1         Tom Cruise    Male                 470
2        Johnny Depp    Male                 400
3     Kim Kardashian  Female                  85

Pandas `merge` allows us to join the two dataframes.

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html

Join by the name?

In [6]:
df = pd.merge(df1, df2, left_on = 'Name', right_on = 'Actor_name') #left_on and right_on specifies the column names we want to join on 
df

,Name,Age,Gender_x,Actor_name,Gender_y,Net_worth_millions
0,Tom Cruise,56,Male,Tom Cruise,Male,470
1,Jennifer Lawrence,28,Female,Jennifer Lawrence,Female,60

Drop the duplicated columns?

In [7]:
df = df.drop(['Actor_name', 'Gender_y'],axis=1)
df

                Name  Age Gender_x  Net_worth_millions
0         Tom Cruise   56     Male                 470
1  Jennifer Lawrence   28   Female                  60

The four types of `merge`

In [8]:
df = pd.merge(df1, df2, left_on = 'Name', right_on = 'Actor_name', how = 'left')
df

,Name,Age,Gender_x,Actor_name,Gender_y,Net_worth_millions
0,Tom Cruise,56,Male,Tom Cruise,Male,470.0
1,Robert Downey Jr,53,Male,NaN,NaN,NaN
2,Chris Hemsworth,35,Male,NaN,NaN,NaN
3,Jennifer Lawrence,28,Female,Jennifer Lawrence,Female,60.0

In [9]:
df = pd.merge(df1, df2, left_on = 'Name', right_on = 'Actor_name', how = 'right') 
df

,Name,Age,Gender_x,Actor_name,Gender_y,Net_worth_millions
0,Tom Cruise,56.0,Male,Tom Cruise,Male,470
1,Jennifer Lawrence,28.0,Female,Jennifer Lawrence,Female,60
2,NaN,NaN,NaN,Johnny Depp,Male,400
3,NaN,NaN,NaN,Kim Kardashian,Female,85

In [10]:
df = pd.merge(df1, df2, left_on = 'Name', right_on = 'Actor_name', how = 'outer') 
df

,Name,Age,Gender_x,Actor_name,Gender_y,Net_worth_millions
0,Tom Cruise,56.0,Male,Tom Cruise,Male,470.0
1,Robert Downey Jr,53.0,Male,NaN,NaN,NaN
2,Chris Hemsworth,35.0,Male,NaN,NaN,NaN
3,Jennifer Lawrence,28.0,Female,Jennifer Lawrence,Female,60.0
4,NaN,NaN,NaN,Johnny Depp,Male,400.0
5,NaN,NaN,NaN,Kim Kardashian,Female,85.0

In [11]:
df = pd.merge(df1, df2, left_on = 'Name', right_on = 'Actor_name', how = 'inner') 
df

,Age,Gender_x,Name,Actor_name,Gender_y,Net_worth_millions
0,56,Male,Tom Cruise,Tom Cruise,Male,470
1,28,Female,Jennifer Lawrence,Jennifer Lawrence,Female,60

As we can see, the default method is `inner`.

Since the dataframes have two common columns, we can also join on both.

In [11]:
df = pd.merge(df1, df2, left_on = ['Name', 'Gender'], right_on = ['Actor_name', 'Gender'])
df

                Name  Age  Gender         Actor_name  Net_worth_millions
0         Tom Cruise   56    Male         Tom Cruise                 470
1  Jennifer Lawrence   28  Female  Jennifer Lawrence                  60

### `merge` vs `concatenate`? (union)

In [12]:
df = pd.concat([df1, df2])
df

C:\Users\yyezeret\AppData\Local\Continuum\Anaconda2\envs\dviz\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          Actor_name   Age  Gender               Name  Net_worth_millions
0                NaN  56.0    Male         Tom Cruise                 NaN
1                NaN  53.0    Male   Robert Downey Jr                 NaN
2                NaN  35.0    Male    Chris Hemsworth                 NaN
3                NaN  28.0  Female  Jennifer Lawrence                 NaN
0  Jennifer Lawrence   NaN  Female                NaN                60.0
1         Tom Cruise   NaN    Male                NaN               470.0
2        Johnny Depp   NaN    Male                NaN               400.0
3     Kim Kardashian   NaN  Female                NaN                85.0

`concat` simply sticks the dataframes together.

We can also stick horizontally.

In [13]:
df = pd.concat([df1, df2], axis = 'columns')
df

,Name,Age,Gender,Actor_name,Gender,Net_worth_millions
0,Tom Cruise,56,Male,Jennifer Lawrence,Female,60
1,Robert Downey Jr,53,Male,Tom Cruise,Male,470
2,Chris Hemsworth,35,Male,Johnny Depp,Male,400
3,Jennifer Lawrence,28,Female,Kim Kardashian,Female,85

## Grouping data

load a slightly larger dataset.

In [14]:
titanic = sns.load_dataset('titanic')

In [15]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

What if we want to look at the data grouped by the sex of passengers?

Documentation: http://pandas.pydata.org/pandas-docs/stable/groupby.html

In [24]:
grp = titanic.groupby('sex')
grp

In [25]:
grp.groups

{'female': Int64Index([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,
             ...
             866, 871, 874, 875, 879, 880, 882, 885, 887, 888],
            dtype='int64', length=314),
 'male': Int64Index([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,
             ...
             873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
            dtype='int64', length=577)}

In [26]:
for name, group in grp:
    print(name)
    print(group)

female
     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
1           1       1  female  38.0      1      0   71.2833        C   First
2           1       3  female  26.0      0      0    7.9250        S   Third
3           1       1  female  35.0      1      0   53.1000        S   First
8           1       3  female  27.0      0      2   11.1333        S   Third
9           1       2  female  14.0      1      0   30.0708        C  Second
10          1       3  female   4.0      1      1   16.7000        S   Third
11          1       1  female  58.0      0      0   26.5500        S   First
14          0       3  female  14.0      0      0    7.8542        S   Third
15          1       2  female  55.0      0      0   16.0000        S  Second
18          0       3  female  31.0      1      0   18.0000        S   Third
19          1       3  female   NaN      0      0    7.2250        C   Third
22          1       3  female  15.0      0      0    8.0292        Q   Third
24          0       3  female   8.0      3      1   21.0750        S   Third
25          1       3  female  38.0      1      5   31.3875        S   Third
28          1       3  female   NaN      0      0    7.8792        Q   Third
31          1       1  female   NaN      1      0  146.5208        C   First
32          1       3  female   NaN      0      0    7.7500        Q   Third
38          0       3  female  18.0      2      0   18.0000        S   Third
39          1       3  female  14.0      1      0   11.2417        C   Third
40          0       3  female  40.0      1      0    9.4750        S   Third
41          0       2  female  27.0      1      0   21.0000        S  Second
43          1       2  female   3.0      1      2   41.5792        C  Second
44          1       3  female  19.0      0      0    7.8792        Q   Third
47          1       3  female   NaN      0      0    7.7500        Q   Third
49          0       3  female  18.0      1      0   17.8000        S   Third
52          1       1  female  49.0      1      0   76.7292        C   First
53          1       2  female  29.0      1      0   26.0000        S  Second
56          1       2  female  21.0      0      0   10.5000        S  Second
58          1       2  female   5.0      1      2   27.7500        S  Second
61          1       1  female  38.0      0      0   80.0000      NaN   First
..        ...     ...     ...   ...    ...    ...       ...      ...     ...
807         0       3  female  18.0      0      0    7.7750        S   Third
809         1       1  female  33.0      1      0   53.1000        S   First
813         0       3  female   6.0      4      2   31.2750        S   Third
816         0       3  female  23.0      0      0    7.9250        S   Third
820         1       1  female  52.0      1      1   93.5000        S   First
823         1       3  female  27.0      0      1   12.4750        S   Third
829         1       1  female  62.0      0      0   80.0000      NaN   First
830         1       3  female  15.0      1      0   14.4542        C   Third
835         1       1  female  39.0      1      1   83.1583        C   First
842         1       1  female  30.0      0      0   31.0000        C   First
849         1       1  female   NaN      1      0   89.1042        C   First
852         0       3  female   9.0      1      1   15.2458        C   Third
853         1       1  female  16.0      0      1   39.4000        S   First
854         0       2  female  44.0      1      0   26.0000        S  Second
855         1       3  female  18.0      0      1    9.3500        S   Third
856         1       1  female  45.0      1      1  164.8667        S   First
858         1       3  female  24.0      0      3   19.2583        C   Third
862         1       1  female  48.0      0      0   25.9292        S   First
863         0       3  female   NaN      8      2   69.5500        S   Third
865         1       2  female  42.0      0      0   13.0000        S  Second
866         1       2  female  27.0      1      0   13.8583        C  Second
871         1       1  female  47.0      1      1   52.5542        S   First
874         1       2  female  28.0      1      0   24.0000        C  Second
875         1       3  female  15.0      0      0    7.2250        C   Third
879         1       1  female  56.0      0      1   83.1583        C   First
880         1       2  female  25.0      0      1   26.0000        S  Second
882         0       3  female  22.0      0      0   10.5167        S   Third
885         0       3  female  39.0      0      5   29.1250        Q   Third
887         1       1  female  19.0      0      0   30.0000        S   First
888         0       3  female   NaN      1      2   23.4500        S   Third

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
10   child       False    G  Southampton   yes  False
11   woman       False    C  Southampton   yes   True
14   child       False  NaN  Southampton    no   True
15   woman       False  NaN  Southampton   yes   True
18   woman       False  NaN  Southampton    no  False
19   woman       False  NaN    Cherbourg   yes   True
22   child       False  NaN   Queenstown   yes   True
24   child       False  NaN  Southampton    no  False
25   woman       False  NaN  Southampton   yes  False
28   woman       False  NaN   Queenstown   yes   True
31   woman       False    B    Cherbourg   yes  False
32   woman       False  NaN   Queenstown   yes   True
38   woman       False  NaN  Southampton    no  False
39   child       False  NaN    Cherbourg   yes  False
40   woman       False  NaN  Southampton    no  False
41   woman       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
44   woman       False  NaN   Queenstown   yes   True
47   woman       False  NaN   Queenstown   yes   True
49   woman       False  NaN  Southampton    no  False
52   woman       False    D    Cherbourg   yes  False
53   woman       False  NaN  Southampton   yes  False
56   woman       False  NaN  Southampton   yes   True
58   child       False  NaN  Southampton   yes  False
61   woman       False    B          NaN   yes   True
..     ...         ...  ...          ...   ...    ...
807  woman       False  NaN  Southampton    no   True
809  woman       False    E  Southampton   yes  False
813  child       False  NaN  Southampton    no  False
816  woman       False  NaN  Southampton    no   True
820  woman       False    B  Southampton   yes  False
823  woman       False    E  Southampton   yes  False
829  woman       False    B          NaN   yes   True
830  child       False  NaN    Cherbourg   yes  False
835  woman       False    E    Cherbourg   yes  False
842  woman       False  NaN    Cherbourg   yes   True
849  woman       False    C    Cherbourg   yes  False
852  child       False  NaN    Cherbourg    no  False
853  woman       False    D  Southampton   yes  False
854  woman       False  NaN  Southampton    no  False
855  woman       False  NaN  Southampton   yes  False
856  woman       False  NaN  Southampton   yes  False
858  woman       False  NaN    Cherbourg   yes  False
862  woman       False    D  Southampton   yes   True
863  woman       False  NaN  Southampton    no  False
865  woman       False  NaN  Southampton   yes   True
866  woman       False  NaN    Cherbourg   yes  False
871  woman       False    D  Southampton   yes  False
874  woman       False  NaN    Cherbourg   yes  False
875  child       False  NaN    Cherbourg   yes   True
879  woman       False    C    Cherbourg   yes  False
880  woman       False  NaN  Southampton   yes  False
882  woman       False  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False

[314 rows x 15 columns]
male
     survived  pclass   sex   age  sibsp  parch      fare embarked   class  \
0           0       3  male  22.0      1      0    7.2500        S   Third
4           0       3  male  35.0      0      0    8.0500        S   Third
5           0       3  male   NaN      0      0    8.4583        Q   Third
6           0       1  male  54.0      0      0   51.8625        S   First
7           0       3  male   2.0      3      1   21.0750        S   Third
12          0       3  male  20.0      0      0    8.0500        S   Third
13          0       3  male  39.0      1      5   31.2750        S   Third
16          0       3  male   2.0      4      1   29.1250        Q   Third
17          1       2  male   NaN      0      0   13.0000        S  Second
20          0       2  male  35.0      0      0   26.0000        S  Second
21          1       2  male  34.0      0      0   13.0000        S  Second
23          1       1  male  28.0      0      0   35.5000        S   First
26          0       3  male   NaN      0      0    7.2250        C   Third
27          0       1  male  19.0      3      2  263.0000        S   First
29          0       3  male   NaN      0      0    7.8958        S   Third
30          0       1  male  40.0      0      0   27.7208        C   First
33          0       2  male  66.0      0      0   10.5000        S  Second
34          0       1  male  28.0      1      0   82.1708        C   First
35          0       1  male  42.0      1      0   52.0000        S   First
36          1       3  male   NaN      0      0    7.2292        C   Third
37          0       3  male  21.0      0      0    8.0500        S   Third
42          0       3  male   NaN      0      0    7.8958        C   Third
45          0       3  male   NaN      0      0    8.0500        S   Third
46          0       3  male   NaN      1      0   15.5000        Q   Third
48          0       3  male   NaN      2      0   21.6792        C   Third
50          0       3  male   7.0      4      1   39.6875        S   Third
51          0       3  male  21.0      0      0    7.8000        S   Third
54          0       1  male  65.0      0      1   61.9792        C   First
55          1       1  male   NaN      0      0   35.5000        S   First
57          0       3  male  28.5      0      0    7.2292        C   Third
..        ...     ...   ...   ...    ...    ...       ...      ...     ...
840         0       3  male  20.0      0      0    7.9250        S   Third
841         0       2  male  16.0      0      0   10.5000        S  Second
843         0       3  male  34.5      0      0    6.4375        C   Third
844         0       3  male  17.0      0      0    8.6625        S   Third
845         0       3  male  42.0      0      0    7.5500        S   Third
846         0       3  male   NaN      8      2   69.5500        S   Third
847         0       3  male  35.0      0      0    7.8958        C   Third
848         0       2  male  28.0      0      1   33.0000        S  Second
850         0       3  male   4.0      4      2   31.2750        S   Third
851         0       3  male  74.0      0      0    7.7750        S   Third
857         1       1  male  51.0      0      0   26.5500        S   First
859         0       3  male   NaN      0      0    7.2292        C   Third
860         0       3  male  41.0      2      0   14.1083        S   Third
861         0       2  male  21.0      1      0   11.5000        S  Second
864         0       2  male  24.0      0      0   13.0000        S  Second
867         0       1  male  31.0      0      0   50.4958        S   First
868         0       3  male   NaN      0      0    9.5000        S   Third
869         1       3  male   4.0      1      1   11.1333        S   Third
870         0       3  male  26.0      0      0    7.8958        S   Third
872         0       1  male  33.0      0      0    5.0000        S   First
873         0       3  male  47.0      0      0    9.0000        S   Third
876         0       3  male  20.0      0      0    9.8458        S   Third
877         0       3  male  19.0      0      0    7.8958        S   Third
878         0       3  male   NaN      0      0    7.8958        S   Third
881         0       3  male  33.0      0      0    7.8958        S   Third
883         0       2  male  28.0      0      0   10.5000        S  Second
884         0       3  male  25.0      0      0    7.0500        S   Third
886         0       2  male  27.0      0      0   13.0000        S  Second
889         1       1  male  26.0      0      0   30.0000        C   First
890         0       3  male  32.0      0      0    7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
4      man        True  NaN  Southampton    no   True
5      man        True  NaN   Queenstown    no   True
6      man        True    E  Southampton    no   True
7    child       False  NaN  Southampton    no  False
12     man        True  NaN  Southampton    no   True
13     man        True  NaN  Southampton    no  False
16   child       False  NaN   Queenstown    no  False
17     man        True  NaN  Southampton   yes   True
20     man        True  NaN  Southampton    no   True
21     man        True    D  Southampton   yes   True
23     man        True    A  Southampton   yes   True
26     man        True  NaN    Cherbourg    no   True
27     man        True    C  Southampton    no  False
29     man        True  NaN  Southampton    no   True
30     man        True  NaN    Cherbourg    no   True
33     man        True  NaN  Southampton    no   True
34     man        True  NaN    Cherbourg    no  False
35     man        True  NaN  Southampton    no  False
36     man        True  NaN    Cherbourg   yes   True
37     man        True  NaN  Southampton    no   True
42     man        True  NaN    Cherbourg    no   True
45     man        True  NaN  Southampton    no   True
46     man        True  NaN   Queenstown    no  False
48     man        True  NaN    Cherbourg    no  False
50   child       False  NaN  Southampton    no  False
51     man        True  NaN  Southampton    no   True
54     man        True    B    Cherbourg    no  False
55     man        True    C  Southampton   yes   True
57     man        True  NaN    Cherbourg    no   True
..     ...         ...  ...          ...   ...    ...
840    man        True  NaN  Southampton    no   True
841    man        True  NaN  Southampton    no   True
843    man        True  NaN    Cherbourg    no   True
844    man        True  NaN  Southampton    no   True
845    man        True  NaN  Southampton    no   True
846    man        True  NaN  Southampton    no  False
847    man        True  NaN    Cherbourg    no   True
848    man        True  NaN  Southampton    no  False
850  child       False  NaN  Southampton    no  False
851    man        True  NaN  Southampton    no   True
857    man        True    E  Southampton   yes   True
859    man        True  NaN    Cherbourg    no   True
860    man        True  NaN  Southampton    no  False
861    man        True  NaN  Southampton    no  False
864    man        True  NaN  Southampton    no   True
867    man        True    A  Southampton    no   True
868    man        True  NaN  Southampton    no   True
869  child       False  NaN  Southampton   yes  False
870    man        True  NaN  Southampton    no   True
872    man        True    B  Southampton    no   True
873    man        True  NaN  Southampton    no   True
876    man        True  NaN  Southampton    no   True
877    man        True  NaN  Southampton    no   True
878    man        True  NaN  Southampton    no   True
881    man        True  NaN  Southampton    no   True
883    man        True  NaN  Southampton    no   True
884    man        True  NaN  Southampton    no   True
886    man        True  NaN  Southampton    no   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[577 rows x 15 columns]

In [27]:
grp.get_group('female')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
25,1,3,female,38.0,1,5,31.3875,S,Third,woman,False,NaN,Southampton,yes,False
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
39,1,3,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
40,0,3,female,40.0,1,0,9.4750,S,Third,woman,False,NaN,Southampton,no,False
41,0,2,female,27.0,1,0,21.0000,S,Second,woman,False,NaN,Southampton,no,False
43,1,2,female,3.0,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
44,1,3,female,19.0,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
47,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
49,0,3,female,18.0,1,0,17.8000,S,Third,woman,False,NaN,Southampton,no,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
53,1,2,female,29.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
56,1,2,female,21.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
58,1,2,female,5.0,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False
61,1,1,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
807,0,3,female,18.0,0,0,7.7750,S,Third,woman,False,NaN,Southampton,no,True
809,1,1,female,33.0,1,0,53.1000,S,First,woman,False,E,Southampton,yes,False
813,0,3,female,6.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
816,0,3,female,23.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,no,True
820,1,1,female,52.0,1,1,93.5000,S,First,woman,False,B,Southampton,yes,False
823,1,3,female,27.0,0,1,12.4750,S,Third,woman,False,E,Southampton,yes,False
829,1,1,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
830,1,3,female,15.0,1,0,14.4542,C,Third,child,False,NaN,Cherbourg,yes,False
835,1,1,female,39.0,1,1,83.1583,C,First,woman,False,E,Cherbourg,yes,False
842,1,1,female,30.0,0,0,31.0000,C,First,woman,False,NaN,Cherbourg,yes,True
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False
852,0,3,female,9.0,1,1,15.2458,C,Third,child,False,NaN,Cherbourg,no,False
853,1,1,female,16.0,0,1,39.4000,S,First,woman,False,D,Southampton,yes,False
854,0,2,female,44.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,no,False
855,1,3,female,18.0,0,1,9.3500,S,Third,woman,False,NaN,Southampton,yes,False
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
858,1,3,female,24.0,0,3,19.2583,C,Third,woman,False,NaN,Cherbourg,yes,False
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
865,1,2,female,42.0,0,0,13.0000,S,Second,woman,False,NaN,Southampton,yes,True
866,1,2,female,27.0,1,0,13.8583,C,Second,woman,False,NaN,Cherbourg,yes,False
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [28]:
grp.size()

sex
female    314
male      577
dtype: int64

In [29]:
grp.aggregate(np.mean)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

Group by more than 1 columns?

In [0]:
grp = titanic.groupby(['sex', 'pclass'])

In [34]:
grp.groups

{('female',
  1): Int64Index([  1,   3,  11,  31,  52,  61,  88, 136, 151, 166, 177, 194, 195,
             215, 218, 230, 256, 257, 258, 268, 269, 275, 290, 291, 297, 299,
             306, 307, 309, 310, 311, 318, 319, 325, 329, 334, 337, 341, 356,
             366, 369, 375, 380, 383, 393, 412, 435, 457, 486, 496, 498, 504,
             513, 520, 523, 537, 539, 540, 556, 558, 571, 577, 581, 585, 591,
             609, 627, 641, 669, 689, 700, 708, 710, 716, 730, 742, 759, 763,
             765, 779, 781, 796, 809, 820, 829, 835, 842, 849, 853, 856, 862,
             871, 879, 887],
            dtype='int64'),
 ('female',
  2): Int64Index([  9,  15,  41,  43,  53,  56,  58,  66,  84,  98, 123, 133, 161,
             190, 199, 211, 237, 247, 259, 272, 303, 312, 316, 322, 323, 327,
             345, 346, 357, 387, 389, 399, 416, 417, 426, 427, 432, 437, 440,
             443, 446, 458, 472, 473, 506, 516, 518, 526, 530, 535, 546, 576,
             580, 596, 600, 608, 615, 618, 635, 651, 670, 706, 717, 720, 726,
             747, 750, 754, 772, 774, 801, 854, 865, 866, 874, 880],
            dtype='int64'),
 ('female', 3): Int64Index([  2,   8,  10,  14,  18,  19,  22,  24,  25,  28,
             ...
             823, 830, 852, 855, 858, 863, 875, 882, 885, 888],
            dtype='int64', length=144),
 ('male', 1): Int64Index([  6,  23,  27,  30,  34,  35,  54,  55,  62,  64,
             ...
             793, 802, 806, 815, 822, 839, 857, 867, 872, 889],
            dtype='int64', length=122),
 ('male', 2): Int64Index([ 17,  20,  21,  33,  70,  72,  78,  99, 117, 120,
             ...
             812, 817, 827, 831, 841, 848, 861, 864, 883, 886],
            dtype='int64', length=108),
 ('male', 3): Int64Index([  0,   4,   5,   7,  12,  13,  16,  26,  29,  36,
             ...
             868, 869, 870, 873, 876, 877, 878, 881, 884, 890],
            dtype='int64', length=347)}

Often after creating groups, we want to do some calculation for each group.

e.g. Calculate the average age of each sex?

In [0]:
grp = titanic.groupby('sex').mean()

In [42]:
grp

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

The group names are used as the new index.

Can be changed using the `reset_index` method

In [24]:
grp.reset_index()

,sex,survived,pclass,age,sibsp,parch,fare,adult_male,alone
0,female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
1,male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

Alternatively:

In [25]:
grp = titanic.groupby('sex').agg(np.mean)
grp.reset_index()

,sex,survived,pclass,age,sibsp,parch,fare,adult_male,alone
0,female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
1,male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

Applying multiple calculations

In [26]:
grp = titanic.groupby('sex')
grp['age'].agg([np.sum, np.mean, np.std]).reset_index()

      sex       sum       mean        std
0  female   7286.00  27.915709  14.110146
1    male  13919.17  30.726645  14.678201